package wisegrid.data;

/**
 * 일반 조회용 데이터
 * @author iCOMPIA CORP.
 */
public class SampleData {
	String[][] data = {
			{"CPU"  ,  "Intel Core 2 Extreme"  ,  "IT20061207001"  ,  "EE X6800"  ,  "2.93GHz/FSB 1066/4MB L2"  ,  "EA"  ,  "1219000"  ,  "155"  ,  "20070201"  ,  "20070201"  ,  "1"},
			{"CPU"  ,  "Intel Core 2 Extreme"  ,  "IT20061207002"  ,  "E6700"  ,  "2.66GHz/FSB 1066/4MB L2"  ,  "EA"  ,  "580700"  ,  "237"  ,  "20070201"  ,  "20070201"  ,  "2"},
			{"CPU"  ,  "Intel"  ,  "IT20061207003"  ,  "Pentium D 960"  ,  "3.6GHz/4MB/Dual Core"  ,  "EA"  ,  "379100"  ,  "125"  ,  "20070201"  ,  "20070201"  ,  "3"},
			{"CPU"  ,  "Intel"  ,  "IT20061207004"  ,  "Pentium D 950"  ,  "3.4GHz/4MB/Dual Core"  ,  "EA"  ,  "262400"  ,  "324"  ,  "20070201"  ,  "20070201"  ,  "4"},
			{"CPU"  ,  "Intel"  ,  "IT20061207005"  ,  "Pentium 4 661 시더밀"  ,  "3.6GHz/2MB/64BIT"  ,  "EA"  ,  "434900"  ,  "651"  ,  "20070201"  ,  "20070201"  ,  "5"},
			{"CPU"  ,  "Intel"  ,  "IT20061207006"  ,  "Pentium 4 630"  ,  "3.0GHz/2MB/64BIT"  ,  "EA"  ,  "147000"  ,  "642"  ,  "20070201"  ,  "20070201"  ,  "6"},
			{"CPU"  ,  "Intel"  ,  "IT20061207007"  ,  "Celeron D 356 시더밀"  ,  "3.33GHz/512KB/64BIT/LGA775"  ,  "EA"  ,  "70000"  ,  "1231"  ,  "20070201"  ,  "20070201"  ,  "7"},
			{"CPU"  ,  "Intel"  ,  "IT20061207008"  ,  "Celeron D 346"  ,  "3.06GHz/64BIT/LGA775"  ,  "EA"  ,  "58200"  ,  "4216"  ,  "20070201"  ,  "20070201"  ,  "8"},
			{"CPU"  ,  "Athlon"  ,  "IT20061207009"  ,  "Athlon 64 X2 5200+"  ,  "2.6GHz/1MB+1MB/Socket AM2"  ,  "EA"  ,  "359600"  ,  "872"  ,  "20070201"  ,  "20070201"  ,  "9"},
			{"CPU"  ,  "Athlon"  ,  "IT20061207010"  ,  "Athlon 64 3800+"  ,  "2.4GHz/512KB/Socket AM2"  ,  "EA"  ,  "107100"  ,  "852"  ,  "20070201"  ,  "20070201"  ,  "10"},
			{"CPU"  ,  "Athlon"  ,  "IT20061207011"  ,  "Sempron 3600+"  ,  "2.0GHz/256KB/Socket AM2"  ,  "EA"  ,  "109200"  ,  "541"  ,  "20070201"  ,  "20070201"  ,  "11"},
			{"MEM"  ,  "Samsung"  ,  "IT20061207012"  ,  "2GB DDR2 PC2-5300 (667MHz)"  ,  "2GB DDR2 PC2-5300 (667MHz)"  ,  "EA"  ,  "258000"  ,  "478"  ,  "20070201"  ,  "20070201"  ,  "12"},
			{"MEM"  ,  "Samsung"  ,  "IT20061207013"  ,  "2GB DDR2 PC2-4200 (533MHz)"  ,  "2GB DDR2 PC2-4200 (533MHz)"  ,  "EA"  ,  "206300"  ,  "7263"  ,  "20070201"  ,  "20070201"  ,  "13"},
			{"MEM"  ,  "디지웍스"  ,  "IT20061207014"  ,  "2GB (1GBx2개) 듀얼채널 킷 DDR2 PC2-6400 (800Mhz) 골드"  ,  "2GB (1GBx2개) 듀얼채널 킷 DDR2 PC2-6400 (800Mhz) 골드"  ,  "EA"  ,  "245700"  ,  "5243"  ,  "20070201"  ,  "20070201"  ,  "14"},
			{"MEM"  ,  "디지웍스"  ,  "IT20061207015"  ,  "1GB (512MBx2개) 듀얼채널 킷 DDR2 PC2-6400 (800Mhz)"  ,  "1GB (512MBx2개) 듀얼채널 킷 DDR2 PC2-6400 (800Mhz)"  ,  "EA"  ,  "123900"  ,  "3574"  ,  "20070201"  ,  "20070201"  ,  "15"},
			{"MAB"  ,  "ASUS"  ,  "IT20061207016"  ,  "P5N32-SLI PREMIUM WiFi-AP Edition"  ,  "590 SLi/LGA775/코어2듀오 콘로 지원"  ,  "EA"  ,  "280800"  ,  "2457"  ,  "20070201"  ,  "20070201"  ,  "16"},
			{"MAB"  ,  "ASUS"  ,  "IT20061207017"  ,  "P5B-E"  ,  "P965/LGA775/코어2듀오 콘로 지원"  ,  "EA"  ,  "148700"  ,  "4357"  ,  "20070201"  ,  "20070201"  ,  "17"},
			{"MAB"  ,  "GIGABYTE"  ,  "IT20061207018"  ,  "GA-965P-DS3"  ,  "P965/LGA775/코어2듀오 콘로 지원"  ,  "EA"  ,  "145600"  ,  "1278"  ,  "20070201"  ,  "20070201"  ,  "18"},
			{"MAB"  ,  "Intel"  ,  "IT20061207019"  ,  "S975XBX2"  ,  "i975X/LGA775/코어2듀오 콘로 지원"  ,  "EA"  ,  "275600"  ,  "6547"  ,  "20070201"  ,  "20070201"  ,  "19"},
			{"MAB"  ,  "Intel"  ,  "IT20061207020"  ,  "DP965LT"  ,  "P965/LGA775/코어2듀오 콘로 지원"  ,  "EA"  ,  "125800"  ,  "3247"  ,  "20070201"  ,  "20070201"  ,  "20"}};
	public SampleData(){

	}

	/* 데이터의 row 수 */
	public int getRowcount() {
		return data.length;
	}

	/* 데이터의 값 */
	public String getValue(int row, int col) {
		return data[row][col];
	}
}
